async function testPost() {

    const response = await fetch(
        "http://localhost:3000/api/movies",
        {
            method: "POST",

            headers: {
                "Content-Type": "application/json"
            },

            body: JSON.stringify({
                poster: "The Return Of The Condor Heroes.webp",
                title: "The Return Of The Condor Heroes",
                category: "Drama - Sci-Fi & Fantasy",
                year: 2006,
                link: "https://t.me/luckyseries1/19",
                review: `ဒီဇာတ်လမ်းတွဲကတော့ သိုင်းလောကသားတွေကြားမှာ ဘယ်တော့မှရိုးမသွားဘဲ ယနေ့အထိ နာမည်တစ်လုံးနဲ့ ရပ်တည်နေတဲ့ စာရေးဆရာကြီး ‘ကျင်းယုံ’ ရဲ့ နာမည်ကျော် သိုင်းဝတ္ထုကြီးကို ပြန်ရိုက်ထားတာပါ။ အပိုင်း ၃ ပိုင်း (ခေတ် ၃ ခေတ်) အချိတ်အဆက်မိမိနဲ့ အချစ်၊ အလွမ်း၊ သံယောဇဉ်၊ အာဏာလုပွဲတွေကို အစအဆုံး ရင်ခုန်စိတ်လှုပ်ရှားစရာ ကောင်းအောင် ရိုက်ပြထားပါတယ်။ ခေတ်အဆက်ဆက် ဗားရှင်းမျိုးစုံ ထွက်ခဲ့ဖူးပေမယ့် ‘လီယီဖန်’ (ဂူးဂူး) သရုပ်ဆောင်ထားတဲ့ ဒီ ၂၀၀၆ ဗားရှင်းကတော့ ပရိသတ်တွေကြားထဲမှာ ရေပန်းအစားဆုံးနဲ့ လူကြိုက်အများဆုံးပါပဲ။

ဇာတ်လမ်းအကျဉ်း
ပထမတွဲဖြစ်တဲ့ ကောက်ကျင့်နဲ့ ဟွမ်းယုံတို့ခေတ်အပြီးမှာ မွေးကတည်းက အဖေမရှိဘဲ မိခင်ဖြစ်သူရဲ့ သနားကြင်နာတတ်တဲ့ နှလုံးသားကို အမွေရထားတဲ့ မျက်နှာမွဲ အပယ်ခံလူငယ်လေး ‘ရန်ကော်’ ရဲ့ အကြောင်းကို စတင်ဇာတ်အိမ်တည်ထားတာပါ။ ဖခင်ရဲ့ စိတ်နေစိတ်ထားမျိုးလည်းပါတဲ့ ရန်ကော်တစ်ယောက် ဘဝရဲ့ တိုက်ပွဲတွေ၊ အခက်အခဲတွေကြားထဲမှာ ‘လုံမိန်းကလေး’ နဲ့အတူ ဘယ်လိုတောင် ဒူးမထောက်ဘဲ ရုန်းကန်ရှင်သန် ဖြတ်သန်းခဲ့ရလဲဆိုတာကို ကြည့်ရှုရမှာ ဖြစ်ပါတယ်။`,
                fileSize: "500MB to 700MB",
                quality: "720P",
                duration: null,
                rating: "6.0/10",
                type: "series",
                episodes: 41
            })
        }
    );

    const result = await response.json();

    console.log(result);
}

testPost();